# include <stdio.h>

int main(void)
{
	int a[5] = {1,2,3,4,5};    //此时a[5]中的a是数组名，它是个指针常量；不是a[i]中的a，它是个变量，[i]是下标
	int i;

	for (i=0; i<5; ++i)
	{
//		printf("a = %#X\n", a);
//		printf("%d\n", a[i]);  //a[i] == *(a+i)  //*(a+i)是数组内第i+1个元素的地址，第i+1个元素为a[i]
		printf("%d\n", *(a+i));
//		printf("%#X\n", a+1);
//		printf("%#X\n", &a[i]);
	}
	return 0;
}
/*
	输出结果是：
------------------------------------------------
a = 0X19FF2C    //a = &a[0] 

a[0] = 1        //a[0] = *a      //a是个指针变量，a存放的是数组内第一个元素的地址
&a[0] = 0X19FF2C------44

a[1] = 2		//a[1] = *(a+1)  //*(a+1)是数组内第2个元素的地址
&a[1] = 0X19FF30------48

a[2] = 3
&a[2] = 0X19FF34------52

a[3] = 4
&a[3] = 0X19FF38------56

a[4] = 5
&a[4] = 0X19FF3C------60
------------------------------------------------
*/