# include <stdio.h>

int main(void)
{
/*
	int i = 3;
	int j = 5                   ;

	i = j;
	j = i;

	printf("i = %d, j = %d\n", i, j);      //i = 5, j = 5
*/                                 
/*
	int a = 3;
	int b = 5;
	int c;

	c = a;   //c相当于一个空杯子，临时存放a中的内容，等b中水倒完了，再倒给b
	a = b;
	b = c;

	printf("a = %d, b = %d\n", a, b);
`*/
/*	
	int a, b, c;
	
	scanf("%d %d", &a, &b);
	
	c = a;
	a = b;
	b = c;

	printf("a = %d, b = %d\n", a, b);
*/

	return 0;
}
/*
---------------------------------------------------------------
总结：容器倒水；
c相当于一个空杯子，临时存放a中的内容，等b中水倒完了，再倒给b
---------------------------------------------------------------
*/